### Imports

In [69]:
import pandas as pd
import os
import pprint

### View data

In [70]:
file_path = "../raw data"
csv_files = os.listdir(file_path)

In [71]:
%%time
df_list = []
standard_format_files = set([#'whistler.csv'
                             'squaw.csv'
                             ,'snowbird.csv'
                             ,'mtBaker.csv'
                             ,'jackson.csv'
                             ,'bigsky.csv'])
for csv_file in csv_files:
    if csv_file in standard_format_files:
        df_ = pd.read_csv(file_path+"/"+csv_file,parse_dates={'date':[0]}, infer_datetime_format=True)
        df_list.append(df_)
snow_data = pd.concat(df_list)
#snow_data.fillna(0,inplace=True)
display(snow_data.head())

        date mountain   max
0 1992-01-01  Big Sky  16.5
1 1993-01-01  Big Sky  21.4
2 1994-01-01  Big Sky  13.8
3 1995-01-01  Big Sky  28.6
4 1996-01-01  Big Sky  30.7

CPU times: user 22.2 ms, sys: 3.18 ms, total: 25.4 ms
Wall time: 24 ms

### Check for Null Values

In [72]:
nulls = snow_data[snow_data.isnull().any(axis=1)]
print("Total rows w/ null values: {:,}".format(nulls.shape[0]))
nulls.head()

Total rows w/ null values: 1

         date  mountain  max
26 2016-01-01  snowbird  NaN

### Data cleanse

In [73]:
"date" in snow_data.columns

True

In [74]:
%%time
###
### unify timestamp
###
snow_data.loc[:,"day"] = pd.to_datetime(snow_data.date.dt.strftime('%Y-%m-%d'), format='%Y-%m-%d')
###
### review
###
print("REVIEW:")
display(snow_data.loc[snow_data.loc[:,"mountain"]=="whistler",].head())

REVIEW:

Empty DataFrame
Columns: [date, mountain, max, day]
Index: []

CPU times: user 10.8 ms, sys: 2.74 ms, total: 13.5 ms
Wall time: 11.3 ms

### group by day

In [75]:
###
### group by day
###
print("GROUP BY DAY:")
snow_data_g = snow_data.groupby(by=["day"]).agg({"mountain":["unique","nunique"],"max":"unique"})
display(snow_data_g.head())

GROUP BY DAY:

           mountain              max
             unique nunique   unique
day
1981-01-01  [squaw]       1   [38.4]
1982-01-01  [squaw]       1   [92.1]
1983-01-01  [squaw]       1  [110.2]
1984-01-01  [squaw]       1   [49.6]
1985-01-01  [squaw]       1   [33.1]

### create data container

In [76]:
%%time
###
### create data container
###
unique_mtn_values = snow_data.mountain.unique().tolist()
data = {mtn:[] for i,mtn in enumerate(unique_mtn_values)}
data["date"] = []
display(data)

{'Big Sky': [],
 'squaw': [],
 'Mt. Baker': [],
 'Jackson Hole': [],
 'snowbird': [],
 'date': []}

CPU times: user 1.97 ms, sys: 1.29 ms, total: 3.25 ms
Wall time: 2.05 ms

### finalize data format for final df

In [77]:
###
### finalize data format for final df
### 
def fill_in_missing_snow_values(row, data,unique_mtn_values):
    d = dict(zip(row.mountain["unique"],row["max"]["unique"]))
    for mtn in unique_mtn_values:
        if mtn in d:
            data[mtn].append(d[mtn])
        else:
            data[mtn].append(None)
    data["date"].append(row.name)
    
snow_data_g.apply(fill_in_missing_snow_values,axis=1,args=[data,unique_mtn_values])
final_struct = pd.DataFrame(data)
final_struct.set_index("date",inplace=True)
print("FINAL DATAFRAME STRUCTURE:")
display(final_struct.head())

FINAL DATAFRAME STRUCTURE:

            Big Sky  squaw  Mt. Baker  Jackson Hole  snowbird
date
1981-01-01      NaN   38.4        NaN           NaN       NaN
1982-01-01      NaN   92.1        NaN           NaN       NaN
1983-01-01      NaN  110.2        NaN           NaN       NaN
1984-01-01      NaN   49.6        NaN           NaN       NaN
1985-01-01      NaN   33.1        NaN           NaN       NaN

### fill in missing dates

See [Date offsets](http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects).

In [78]:
###
### fill in missing dates
### 
def custom_resampler(array):
    try: 
        value = sum(array)
    except TypeError:
        value = None
    return value
final_df = final_struct.resample('A').apply(custom_resampler)
print("FiNAL DATAFRAME:")
display(final_df)

FiNAL DATAFRAME:

            Big Sky  squaw  Mt. Baker  Jackson Hole  snowbird
date
1981-12-31      NaN   38.4        NaN           NaN       NaN
1982-12-31      NaN   92.1        NaN           NaN       NaN
1983-12-31      NaN  110.2        NaN           NaN       NaN
1984-12-31      NaN   49.6        NaN           NaN       NaN
1985-12-31      NaN   33.1        NaN           NaN       NaN
1986-12-31      NaN   70.5        NaN           NaN       NaN
1987-12-31      NaN   33.3        NaN          17.3       NaN
1988-12-31      NaN   29.7        NaN          23.8       NaN
1989-12-31      NaN   54.5        NaN          38.7       NaN
1990-12-31      NaN   27.9        NaN          23.1      34.0
1991-12-31      NaN   33.2        NaN          29.0      40.0
1992-12-31     16.5   33.7        NaN          19.0      23.0
1993-12-31     21.4   99.9        NaN          34.6      66.9
1994-12-31     13.8   31.9        NaN          21.5       NaN
1995-12-31     28.6  116.5        NaN          33.9      58.9
1996-12-31     30.7   65.1        NaN          38.5      52.9
1997-12-31     32.4   90.0        NaN          44.3      58.3
1998-12-31     20.8   87.0        NaN          28.0      44.7
1999-12-31     24.5   74.3        NaN          36.2      50.5
2000-12-31     18.1   56.7        NaN          23.9      37.5
2001-12-31     16.4   36.0        NaN          18.8      36.6
2002-12-31     19.6   62.3        NaN          24.2      50.2
2003-12-31     22.8   68.4       61.7          25.4      36.2
2004-12-31     15.9   49.9       67.5          24.0      42.9
2005-12-31     15.6   75.7       32.1          23.1      74.6
2006-12-31     25.8   88.5       68.7          36.4      68.9
2007-12-31     17.8   32.2       72.4          18.8      30.1
2008-12-31     26.5   40.0       73.3          36.9      57.8
2009-12-31     25.8   46.7       72.3          31.4      54.1
2010-12-31     18.0   51.7       57.7          19.1      40.4
2011-12-31     33.4   73.4       89.1          44.0      75.1
2012-12-31     19.1   35.4       97.4          24.3      32.8
2013-12-31     19.7   35.1       81.4          25.5      35.0
2014-12-31     30.0   22.0       85.0          36.8      32.5
2015-12-31     15.7   18.4       22.6          21.8      21.6
2016-12-31     18.8   42.5       56.7          22.3       NaN
2017-12-31     22.2   82.8       79.6          42.0      59.3
2018-12-31     29.8   36.2        NaN          33.2      30.0

### Munge & save D3js data

In [82]:
d3_df = final_df.reset_index()
d3_data_format = d3_df.to_json(orient='records',date_format="iso")
d3_df.to_json("../d3js_data/d3js_data_yearEnd(sansWhistler).json",orient='records',date_format="iso")
pprint.pprint(d3_data_format)

('[{"date":"1981-12-31T00:00:00.000Z","Big Sky":null,"squaw":38.4,"Mt. '
 'Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1982-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":92.1,"Mt. Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1983-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":110.2,"Mt. Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1984-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":49.6,"Mt. Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1985-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":33.1,"Mt. Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1986-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":70.5,"Mt. Baker":null,"Jackson '
 'Hole":null,"snowbird":null},{"date":"1987-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":33.3,"Mt. Baker":null,"Jackson '
 'Hole":17.3,"snowbird":null},{"date":"1988-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":29.7,"Mt. Baker":null,"Jackson '
 'Hole":23.8,"snowbird":null},{"date":"1989-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":54.5,"Mt. Baker":null,"Jackson '
 'Hole":38.7,"snowbird":null},{"date":"1990-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":27.9,"Mt. Baker":null,"Jackson '
 'Hole":23.1,"snowbird":34.0},{"date":"1991-12-31T00:00:00.000Z","Big '
 'Sky":null,"squaw":33.2,"Mt. Baker":null,"Jackson '
 'Hole":29.0,"snowbird":40.0},{"date":"1992-12-31T00:00:00.000Z","Big '
 'Sky":16.5,"squaw":33.7,"Mt. Baker":null,"Jackson '
 'Hole":19.0,"snowbird":23.0},{"date":"1993-12-31T00:00:00.000Z","Big '
 'Sky":21.4,"squaw":99.9,"Mt. Baker":null,"Jackson '
 'Hole":34.6,"snowbird":66.9},{"date":"1994-12-31T00:00:00.000Z","Big '
 'Sky":13.8,"squaw":31.9,"Mt. Baker":null,"Jackson '
 'Hole":21.5,"snowbird":null},{"date":"1995-12-31T00:00:00.000Z","Big '
 'Sky":28.6,"squaw":116.5,"Mt. Baker":null,"Jackson '
 'Hole":33.9,"snowbird":58.9},{"date":"1996-12-31T00:00:00.000Z","Big '
 'Sky":30.7,"squaw":65.1,"Mt. Baker":null,"Jackson '
 'Hole":38.5,"snowbird":52.9},{"date":"1997-12-31T00:00:00.000Z","Big '
 'Sky":32.4,"squaw":90.0,"Mt. Baker":null,"Jackson '
 'Hole":44.3,"snowbird":58.3},{"date":"1998-12-31T00:00:00.000Z","Big '
 'Sky":20.8,"squaw":87.0,"Mt. Baker":null,"Jackson '
 'Hole":28.0,"snowbird":44.7},{"date":"1999-12-31T00:00:00.000Z","Big '
 'Sky":24.5,"squaw":74.3,"Mt. Baker":null,"Jackson '
 'Hole":36.2,"snowbird":50.5},{"date":"2000-12-31T00:00:00.000Z","Big '
 'Sky":18.1,"squaw":56.7,"Mt. Baker":null,"Jackson '
 'Hole":23.9,"snowbird":37.5},{"date":"2001-12-31T00:00:00.000Z","Big '
 'Sky":16.4,"squaw":36.0,"Mt. Baker":null,"Jackson '
 'Hole":18.8,"snowbird":36.6},{"date":"2002-12-31T00:00:00.000Z","Big '
 'Sky":19.6,"squaw":62.3,"Mt. Baker":null,"Jackson '
 'Hole":24.2,"snowbird":50.2},{"date":"2003-12-31T00:00:00.000Z","Big '
 'Sky":22.8,"squaw":68.4,"Mt. Baker":61.7,"Jackson '
 'Hole":25.4,"snowbird":36.2},{"date":"2004-12-31T00:00:00.000Z","Big '
 'Sky":15.9,"squaw":49.9,"Mt. Baker":67.5,"Jackson '
 'Hole":24.0,"snowbird":42.9},{"date":"2005-12-31T00:00:00.000Z","Big '
 'Sky":15.6,"squaw":75.7,"Mt. Baker":32.1,"Jackson '
 'Hole":23.1,"snowbird":74.6},{"date":"2006-12-31T00:00:00.000Z","Big '
 'Sky":25.8,"squaw":88.5,"Mt. Baker":68.7,"Jackson '
 'Hole":36.4,"snowbird":68.9},{"date":"2007-12-31T00:00:00.000Z","Big '
 'Sky":17.8,"squaw":32.2,"Mt. Baker":72.4,"Jackson '
 'Hole":18.8,"snowbird":30.1},{"date":"2008-12-31T00:00:00.000Z","Big '
 'Sky":26.5,"squaw":40.0,"Mt. Baker":73.3,"Jackson '
 'Hole":36.9,"snowbird":57.8},{"date":"2009-12-31T00:00:00.000Z","Big '
 'Sky":25.8,"squaw":46.7,"Mt. Baker":72.3,"Jackson '
 'Hole":31.4,"snowbird":54.1},{"date":"2010-12-31T00:00:00.000Z","Big '
 'Sky":18.0,"squaw":51.7,"Mt. Baker":57.7,"Jackson '
 'Hole":19.1,"snowbird":40.4},{"date":"2011-12-31T00:00:00.000Z","Big '
 'Sky":33.4,"squaw":73.4,"Mt. Baker":89.1,"Jackson '
 'Hole":44.0,"snowbird":75.1},{"date":"2012-12-31T00:00:00.000Z","Big '
 'Sky":19.1,"squaw":35.4,"Mt. Baker":97.4,"Jackson '
 'Hole":24.3,"snowbird":32.8},{"date":"2013-12-31T00:00:00.000Z","Big '
 'Sky":19.7,"squaw":35.1,"Mt. Baker":81.4,"Jackson '
 'Hole":25.5,"snowbird":35.0},{"date":"2014-12-31T00:00:00.000Z","Big '
 'Sky":30.0,"squaw":22.0,"Mt. Baker":85.0,"Jackson '
 'Hole":36.8,"snowbird":32.5},{"date":"2015-12-31T00:00:00.000Z","Big '
 'Sky":15.7,"squaw":18.4,"Mt. Baker":22.6,"Jackson '
 'Hole":21.8,"snowbird":21.6},{"date":"2016-12-31T00:00:00.000Z","Big '
 'Sky":18.8,"squaw":42.5,"Mt. Baker":56.7,"Jackson '
 'Hole":22.3,"snowbird":null},{"date":"2017-12-31T00:00:00.000Z","Big '
 'Sky":22.2,"squaw":82.8,"Mt. Baker":79.6,"Jackson '
 'Hole":42.0,"snowbird":59.3},{"date":"2018-12-31T00:00:00.000Z","Big '
 'Sky":29.8,"squaw":36.2,"Mt. Baker":null,"Jackson '
 'Hole":33.2,"snowbird":30.0}]')

In [80]:
d3_df.describe()

         Big Sky       squaw  Mt. Baker  Jackson Hole   snowbird
count  27.000000   38.000000  15.000000     32.000000  27.000000
mean   22.211111   55.915789  67.833333     28.743750  46.103704
std     5.765036   26.032220  20.004273      8.100017  15.191862
min    13.800000   18.400000  22.600000     17.300000  21.600000
25%    17.900000   34.050000  59.700000     22.900000  34.500000
50%    20.800000   49.750000  72.300000     25.450000  42.900000
75%    26.150000   74.075000  80.500000     36.250000  58.050000
max    33.400000  116.500000  97.400000     44.300000  75.100000

In [81]:
d3_df.loc[d3_df.loc[:,"Jackson Hole"]>0,]

         date  Big Sky  squaw  Mt. Baker  Jackson Hole  snowbird
6  1987-12-31      NaN   33.3        NaN          17.3       NaN
7  1988-12-31      NaN   29.7        NaN          23.8       NaN
8  1989-12-31      NaN   54.5        NaN          38.7       NaN
9  1990-12-31      NaN   27.9        NaN          23.1      34.0
10 1991-12-31      NaN   33.2        NaN          29.0      40.0
11 1992-12-31     16.5   33.7        NaN          19.0      23.0
12 1993-12-31     21.4   99.9        NaN          34.6      66.9
13 1994-12-31     13.8   31.9        NaN          21.5       NaN
14 1995-12-31     28.6  116.5        NaN          33.9      58.9
15 1996-12-31     30.7   65.1        NaN          38.5      52.9
16 1997-12-31     32.4   90.0        NaN          44.3      58.3
17 1998-12-31     20.8   87.0        NaN          28.0      44.7
18 1999-12-31     24.5   74.3        NaN          36.2      50.5
19 2000-12-31     18.1   56.7        NaN          23.9      37.5
20 2001-12-31     16.4   36.0        NaN          18.8      36.6
21 2002-12-31     19.6   62.3        NaN          24.2      50.2
22 2003-12-31     22.8   68.4       61.7          25.4      36.2
23 2004-12-31     15.9   49.9       67.5          24.0      42.9
24 2005-12-31     15.6   75.7       32.1          23.1      74.6
25 2006-12-31     25.8   88.5       68.7          36.4      68.9
26 2007-12-31     17.8   32.2       72.4          18.8      30.1
27 2008-12-31     26.5   40.0       73.3          36.9      57.8
28 2009-12-31     25.8   46.7       72.3          31.4      54.1
29 2010-12-31     18.0   51.7       57.7          19.1      40.4
30 2011-12-31     33.4   73.4       89.1          44.0      75.1
31 2012-12-31     19.1   35.4       97.4          24.3      32.8
32 2013-12-31     19.7   35.1       81.4          25.5      35.0
33 2014-12-31     30.0   22.0       85.0          36.8      32.5
34 2015-12-31     15.7   18.4       22.6          21.8      21.6
35 2016-12-31     18.8   42.5       56.7          22.3       NaN
36 2017-12-31     22.2   82.8       79.6          42.0      59.3
37 2018-12-31     29.8   36.2        NaN          33.2      30.0